;Inno Setup XDELTA Patch Language file v1.3 for ISXPM 2.4.0.0
;Language: English
;Author: Kindly

[ISPATCH]
;Buttons
START_BUTTON='Start'
BROWSE_BUTTON='Browse'
INFO_BUTTON='Info'
EXIT_BUTTON='Exit'
BACKUP_BUTTON='Save Backup'
LOG_BUTTON='Save Log'
MUSIC_BUTTON_PLAY='Music'
MUSIC_BUTTON_PAUSE='Music'
VERIFY_BUTTON='Verify Hash'
CLOSE_BUTTON='Close'

;Logs
ROLLBACK_STARTED='Rollback started!'
ROLLBACK_END='Rollback applied due to an error.'

FAILED_TO_ROLLBACK='[!]  Error: Failed to rollback from: '
FAILED_TO_ROLLBACK2=' file to: '


ROLLBACK_SUCCESS2=' to: '
ROLLBACK_SUCCESS3=' success.'

FAILED_TO_DELETE_INCLUDED='[!]  Error: Failed to delete included: '

INCLUDED_DELETED_SUCCESS2=' successfully deleted.'

INCLUDED_DIR_DELETED2=' is empty and was successfully deleted.'

BACKUP_DIR_DELETED2=' was deleted.'

BACKUP_DIR_DELETED_NOT_FULLY2=' cleared with an exception of some currently used files or folders. Check this dir for details.'

ROLLBACK_FINISHED='Rollback complete!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Patching finished with errors!'

EXTRACT_TEMP_PATCH_DATA='Extracting patch-data to a temporary dir...'

START_PATCHING='[Starting patching session]'

TARGET_FILE='--> Target file: '
PATCH_DATA_FILE='=> Patch-data file: '
OUTPUT_PATCHED='>> Output patched: '

ERROR_DELETING_OLD_FILE='[!]  Error occurred while deleting an old file! Perhaps it is used by another program?'

NOT_EXISTS_OR_MISSMATCH='[!]  Error: In the chosen directory required files for patching do not exist or do not match expected hash.'
CORRECT_PROBLEM='[!]  Fix this problem and then try to apply the Patch again.'

PATCHING_END='[Ending patching session]'
COPYING_START='[Starting copying session]'

COPY_FAILED='[!]  Error: Failed to copy included file: '
COPY_FAILED2=' to:'

COPY_IN_USE='Maybe '
COPY_IN_USE2=' is in use!'

INCLUDED_COPYIED2=' is copied to: '

COPYING_END='[Copying session end]'

TEMP_ROLLBACK_DELETED_IN_USE2=' was cleared but unable to delete some used files and/or folders. Check this dir for details.'

EXTERNAL_COPYIED='Additional external files were copied to: '

STORED_BACKUP='Backup files stored in: '

OPERATION_SUCCESS='Operation successfully completed!'

;Checks
FIND_BY_WINDOW_NAME='Target application is running!'
FIND_BY_WINDOW_NAME2='Please close it '
FIND_BY_WINDOW_NAME3=' then run the Patch again!'

FIND_BY_CLASS_NAME='Target application is running'
FIND_BY_CLASS_NAME2='Please close it '
FIND_BY_CLASS_NAME3=' then run the Patch again!'

FIND_BY_MUTEX='Target application is running'
FIND_BY_MUTEX2='Please close it '
FIND_BY_MUTEX3=' then run the Patch again!'

FIND_BY_PROC='Target application is running'
FIND_BY_PROC2='Please close it '
FIND_BY_PROC3=' then run the Patch again!'

;Errors
ORIGINAL_NOT_FOUND='Unable to find applicaiton in chosen directory!'

ROLLBACK_ERROR='Rollback applied due to patching errors.'
ROLLBACK_ERROR2='Rollback of modified files is complete. Any new files were deleted.'
ROLLBACK_ERROR3='Remove backup dir: '
ROLLBACK_ERROR4='completely with all included files and subdirs?'

INCORRECR_PATH_ENTERED='Invalid directory! Please select application directory!'

NOTHING_TO_PATCH='Error! Chosen directory doesn't have required files for patching!'
NOTHING_TO_PATCH2='Please check original files and file names in selected dir!'
NOTHING_TO_PATCH3='Nothing to patch!'
FINISHED_WITH_ERRORS='Patching finished with errors! Check log for details!'
PATCH_UNSUCCESS='[!]  Errors occurred during patching!'

;Informations
BROWSE_DIALOG='Please select a directory where the application resides:'

PATCHING_PROCESS='Patching in progress, please wait...'
PATCH_APPLIED='Done!'
PATCHING='Patching: '
PATCHING_ERROR='Patch was not applied!'
PATCHING_PREPARING='Preparing to patch...'
COPYING_PROCESS='Copying process, please wait...'
COPYING_EXTERNAL='Copying external files...'
FORM_CLOSED='The patch window will be closed automatically after '
FORM_CLOSED2=' seconds.'

;new 0.8
DELETING_JUNKED='[Deleting junk-files]'
COMPLETING_JUNKED='[Done deleting junk-files]'
JUNKED_REMOVED='--> Removed junk-file: '
JUNKED_REM_FAILED='[!]  Failed to remove junk-file: '
FAILED_TO_RESTORE='[!]  Error: Failed to restore junk-file from: '
FAILED_TO_RESTORE2=' to: '
JUNKED_RESTORED='Junk-file: '
JUNKED_RESTORED2=' is successfully restored.'

;new 0.9
;ALLREADY_UPDATED='Application already updated!'


; Language update 0.9a for ISXPM 2.0.0.0 beta 1 
INCORRECT_HASH='File hash mismatch!'
INCORRECT_HASH2='Please check your program version!'
INVALID_HASH='[!]  Error! Invalid hash for: '
VALID_HASH='OK! Valid hash for: '

SET_ATTRIBUTES='Set files attributes...'
SET_ATTRIBUTES_FAILED='[!]  Failed to set original attributes to file: '
SET_ATTRIBUTES_SUCCESS='File attributes were set successfully!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Some attributes were not set!'

HANDLE_ERROR='[!]  Critical error occurred while gaining access to: '

GET_TIME_FAILED='[!]  Failed to get time attributes from file: '
SET_TIME_FAILED='[!]  Failed to set time attributes to file: '

VERIFICATION_START='Starting verification process...'
VERIFICATION_FINISH='Verification process complete! No hash mismatch detected!'

PREPARING_TO_OPERATIONS='Preperation for succeeding operations, waiting for patch engine to unload...'

FORCE_PATCHING='Patching in Forced Mode!'
FORCE_PATCHING2='Only existing required files will be updated, and everything else will be skipped...'

COPYING_EXTERNAL_FILE='--> Copying file to: '
COPYING_EXTERNAL_FILE_FAILED='[!]  An error occurred while copying file: ' 

EXTRACTING_PROCESS='Extracting external data...'
EXTRACTING_EXTERNAL_FILE='--> Extracting data to: '
EXTERNAL_EXTRACTED='Additional external data was extracted to: '
EXTRACTING_START='Extracting process, please wait...'

EXTRACTING_ERROR='[!]  Decompression failed! Perhaps the archive is corrupt or there's not enough free space!'
EXTRACTING_ERROR2='Archive extraction failed!'
EXTRACTING_ERROR3='Perhaps the archive is corrupt or not enough free space?'
EXTRACTING_WITH_ERRORS='Archive extraction completed with errors! Check log for details!'

DOWNLOAD_REQUIRED='This Patch requires to download some data from a server!'
DOWNLOAD_FAILED='[!]  Unable to continue patching process without required data!'
DOWNLOAD_FAILED2='Please provide a connection to the server, and then try again!'

DOWNLOAD_MIRROR='Failed to download data from the main server! Trying to download from a mirror...'
DOWNLOAD_START='Downloading data: '
DOWNLOAD_START2='To: '
DOWNLOAD_START3='Total size: '

READ_OK='Data successfully downloaded!'
CONNECT_ERROR_NETWORK='[!]  Error: There is no Internet connection or possible Internet connection is not active.'
CONNECT_ERROR_OFFLINE='[!]  Error: The computer is in offline mode.'
CONNECT_ERROR_INITIALIZE='[!]  Error: Failed to initialize installation package to gain Internet access.'
CONNECT_ERROR_OPENSESSION='[!]  Error: Failed to open FTP or HTTP session.'
CONNECT_ERROR_CREATEREQUEST='[!]  Error: Failed to create an HTTP request handle.'
CONNECT_ERROR_SENDREQUEST='[!]  Error: Failed to send request to the HTTP server.'
READ_ERROR_DELETEFILE='[!]  Error: Local file exists, but failed to delete it.'
READ_ERROR_SAVEFILE='[!]  Error: Failed to save data to local file.'
READ_ERROR_CANCELED='[!]  Error: Download canceled by user.'
READ_ERROR_READDATA='[!]  Error: Failed to read data from the remote URL.'
UNKNOWN_ERROR='[!]  Unknown error: HTTP status code is: '

CANCEL_DOWNLOAD_BUTTON='Cancel Download'

;old corrected
TOTAL_PATCHED_FILES='Total amount of processed files: '
PATCHING_LOG='Patching log saved to: '
INCLUDED_COPYIED='--> Included file: '
TEMP_ROLLBACK_DELETED='Temporary files for rollback were deleted in: '
DIRECT_PATCH_DATA='Direct access to the patch-data...'

;Strings
DESCRIPTION='Description:'
COPYRIGHT='Copyright:'
CONTACT='Contact:'
INSTALLATION='Installation path:'

;no more used this strings from previous old translation versions
;INCORRECT_MD5='MD5 hash is a not from original file!'
;INCORRECT_MD52='Please check your program version!'
;INVALID_HASH='[!]  Invalid MD5 hash for updated file: '
;VALID_HASH='Valid MD5 hash for updated file: '
;TEMP_ROLLBACK_DELETED2=' was deleted.'

; Language update 0.9b for ISXPM 2.0.0.0 beta 2 
PATCH_TO='Patch to'
FOUNDED_VERSION='Detected: '
VERSION_TO_PATCH='Preparing to patch: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Please set application directory!'

ALLREADY_UPDATED='Application in this directory is current version (already updated)!'
ROLLBACK_SUCCESS='Rollback: '
INCLUDED_DIR_DELETED='Included dir: '
INCLUDED_DELETED_SUCCESS='Included: '
BACKUP_DIR_DELETED='Backup dir: '
BACKUP_DIR_DELETED_NOT_FULLY='Backup dir: '
TEMP_ROLLBACK_DELETED_IN_USE='Temporary rollback dir: '

; Language update 1.0 for ISXPM 2.0.0.0 
EXTRACT_TO_TEMP='Extracting required temporary data...'
EXTRACT_TO_TEMP2='Extracting process, please wait...'
FOUNDED_VERSION_READY='Ready to Patch!'
FILE_NOT_EXISTS='[!]  Required file for patching does not exist: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Unable to find application in chosen directory!'
FOUNDED_VERSION2='Valid version detected! Ready to Patch!'
VERIFICATION_UNSUCCESS='[!]  Some files do not exist or have incorrect hash!'
UNKNOWN_PATCHING_ERROR='[!]  An error occurred while applying patch-data to: '

; Language update 1.1 for ISXPM 2.2.0.0 
LOG_BTN_STATE='Log'

S_PATCHING='--> Patching file: '
S_COPYING='--> Copying file: '
S_EXTRACTING='--> Extracting file: '
S_COPYING_EXTERNAL='--> Copying external file: '
S_ROLLBACK='--> Rollback file: '
S_DELETING='--> Deleting file: '
S_JUNKED_RESTORED='--> Restored junk-file: '
S_INVALID_FILE='[!]  Invalid file: '
S_VALID_FILE='OK! Valid file: '

; Language update 1.2 for ISXPM 2.3.0.0 
VERSION_DETECTING='Detecting version... Please wait...'

; Language update 1.2.1 for ISXPM 2.3.1.0 
FILE_SKIPPED='[!]  Following file does not exist and was skipped: '

; Language update 1.3 for ISXPM 2.4.0.0 
GET_SPACE_FAILED='Not enough free space on '
REQUIRED_SPACE='Required: '
SPACE_GB='Gb!'
SPACE_MB='Mb!'
SPACE_ONLY='There's only '
SPACE_GB_FREE='Gb availabe on volume '
SPACE_MB_FREE='Mb availabe on volume '
SPACE_FREE_ONLY='Available '

;old corrected:
INSTALL_PATH_NOT_FOUND='Required data not found in current dir or wrong version!'


